# Import Pandas and Numpy module.

In [41]:
import pandas as pd
import numpy as np

# Open the Uncleaned data.

In [53]:
df = pd.read_csv(r"D:\PYTON PROGRAMMING\PYTHON FILES\PANDAS\Student Data.csv")
df

           Name  age   Gender Score          city
0      John Doe   17     Male    88      new york
1      jane doe        female    92      New York
2         ALICE   16   Female    85   los Angeles
3     Bob Smith   17     MALE         LOS ANGELES
4      John Doe   17     Male    88      NEW YORK
5         carol   18   female    79       chicago
6           NaN   16     Male    90       Chicago
7           Eve   17   FEMALE    84   LOS angeles
8      michael    19     Male    91        Dallas
9         Sarah        female    89        dallas
10          Ron   18     MALE             Houston
11   mike tyson   17     Male    75       houston
12         Anna   17   Female    80        Boston
13        Steve   18     Male   82         BOSTON
14  emma watson   17   female    86         miami
15   Tom Riddle   16      NaN    80         Miami
16    leo messi         male     94     barcelona
17   Cristiano    18     MALE           Barcelona
18       serena   16   FEMALE    81     barcelona
19         Andy   17     Male    88     barcelona

# Clean all the name data.

In [ ]:
df[['Name', 'city','Gender']] = df[['Name','city','Gender']].apply(lambda col: col.str.title())
df

## Clean the NaN values from the name column by removing the entire row.

In [ ]:
df.dropna(inplace=True)
df.reset_index(drop=True , inplace= True)
df

## Fill all the empty spaces of age column with value 18.

In [ ]:
df['age'].replace(' ', np.nan, inplace=True)
df['age'].fillna(value= 18 ,inplace = True)
df

## Replace all the empty values of score with value 0.

In [ ]:
df.replace(r'^\s*$', np.nan, regex=True, inplace=True)

df['Score'].fillna(0, inplace=True)
df

## Save it to a new csv file.

In [51]:
df.to_csv('cleaned_data.csv', index=False)